/***************************************************
 * 
 * 指的是在编译过程里生成，而不是在开始就定义的变量
 * 
 * ************************************************/
#include<stdio.h>
#include<stdlib.h>

int main()
{
    int a;
    int *p,*q;

    p = (int *)malloc(sizeof(int));
    //这句话强制返回一个int类型，在内存里为之分配一个int整数的大小，并让指针指向该内存

    *p = 1;
    //动态内存。生存期很长，程序退出后依然不会自动清除，即“内存泄漏”

    free(p);
    //动态内存的释放

    //动态内存的生成和释放不一定要在一个函数里面

    /*----------------------------------------------------------------
     *       q = p = (int *)malloc(sizeof(int));
     *       *p = 1;
     *       free(p);
     *       *q = 2;
     * !!!严重错误，use after free！！！
     ----------------------------------------------------------------*/
    
    return 0;
}